In [1]:
import pandas as pd                  #import library

In [2]:
pwd()

'C:\\Users\\ADMIN'

In [3]:
df=pd.read_csv("Data.csv")

In [4]:
df

    name  maths  phy result
0    tom     80   70   Pass
1   jhon     75   67   Pass
2    max     28   55   Fail
3    raj     88   70   Pass
4  shyam     23   29   Fail
5    ram     95   89   Pass

In [5]:
type(df)

pandas.core.frame.DataFrame

In [6]:
df.shape

(6, 4)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   maths   6 non-null      int64
 2   phy     6 non-null      int64
 3   result  6 non-null      object
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes

In [8]:
df["maths"]

0    80
1    75
2    28
3    88
4    23
5    95
Name: maths, dtype: int64

In [9]:
type(df["maths"])                #type of datatype

pandas.core.series.Series

In [10]:
df[["name","maths"]]

    name  maths
0    tom     80
1   jhon     75
2    max     28
3    raj     88
4  shyam     23
5    ram     95

In [11]:
df.head(2)

   name  maths  phy result
0   tom     80   70   Pass
1  jhon     75   67   Pass

In [12]:
df.tail(2)

    name  maths  phy result
4  shyam     23   29   Fail
5    ram     95   89   Pass

In [13]:
df2=pd.read_table("tdata.tsv")

In [14]:
df2

    name  maths  phy result
0    tom     80   70   Pass
1   jhon     75   67   Pass
2    max     28   55   Fail
3    raj     88   70   Pass
4  shyam     23   29   Fail
5    ram     95   89   Pass

In [15]:
df3=pd.read_csv("tdata.tsv")

In [16]:
df3

  name\tmaths\tphy\tresult
0        tom\t80\t70\tPass
1       jhon\t75\t67\tPass
2        max\t28\t55\tFail
3        raj\t88\t70\tPass
4      shyam\t23\t29\tFail
5        ram\t95\t89\tPass

In [17]:
df3=pd.read_csv("tdata.tsv",sep="\t")

In [18]:
df3

    name  maths  phy result
0    tom     80   70   Pass
1   jhon     75   67   Pass
2    max     28   55   Fail
3    raj     88   70   Pass
4  shyam     23   29   Fail
5    ram     95   89   Pass

In [19]:
df4=pd.read_csv("Data.csv",header=None)

In [20]:
df4

       0      1    2       3
0   name  maths  phy  result
1    tom     80   70    Pass
2   jhon     75   67    Pass
3    max     28   55    Fail
4    raj     88   70    Pass
5  shyam     23   29    Fail
6    ram     95   89    Pass

In [21]:
df5=pd.read_csv("Data.csv",names=["a","b","c","d"])

In [22]:
df5

       a      b    c       d
0   name  maths  phy  result
1    tom     80   70    Pass
2   jhon     75   67    Pass
3    max     28   55    Fail
4    raj     88   70    Pass
5  shyam     23   29    Fail
6    ram     95   89    Pass

In [23]:
df6=pd.read_csv("Data.csv",names=["a","b","c"])

In [24]:
df6

           a    b       c
name   maths  phy  result
tom       80   70    Pass
jhon      75   67    Pass
max       28   55    Fail
raj       88   70    Pass
shyam     23   29    Fail
ram       95   89    Pass

In [25]:
df7=pd.read_csv("Data.csv",names=["a","b","c","d","e"])

In [26]:
df7

       a      b    c       d   e
0   name  maths  phy  result NaN
1    tom     80   70    Pass NaN
2   jhon     75   67    Pass NaN
3    max     28   55    Fail NaN
4    raj     88   70    Pass NaN
5  shyam     23   29    Fail NaN
6    ram     95   89    Pass NaN

In [27]:
df8=pd.read_csv("Data.csv",index_col=["maths"])

In [28]:
df8

        name  phy result
maths
80       tom   70   Pass
75      jhon   67   Pass
28       max   55   Fail
88       raj   70   Pass
23     shyam   29   Fail
95       ram   89   Pass

In [29]:
df["result"]

0    Pass
1    Pass
2    Fail
3    Pass
4    Fail
5    Pass
Name: result, dtype: object

In [30]:
df["result"].unique()

array(['Pass', 'Fail'], dtype=object)

In [31]:
df["result"].nunique()

2